#include <stdio.h>
#include <locale.h>

int main() {
	int A, B, C;
	int condition;

	setlocale(LC_CTYPE, ".UTF-8");

	puts("Домашняя работа № 4:\n"
		"20. Три кристалла\n"
		"Чтобы открыть портал, необходимо зажечь три древних кристалла. Кристалл загорается, если переданная ему энергия(A, B, C) кратна трем. Портал откроется только если загорятся все три кристалла\n");

	printf("Введи энергию в формате: A, B, C: ");
	scanf_s("%d, %d, %d", &A, &B, &C);

	condition = ((A % 3 == 0) && (B % 3 == 0) && (C % 3 == 0));
	printf("Доступ открыт (1 - да, 0 - нет): %d\n", condition);

	return 0;
}